[{"id": "1418458961531969538", "text": "Thanks to @urbancompany_UC professional Nafees for providing such a great Salon for Men experience. Given their safe and hygienic services, would not want to step out at all! Happy customer &lt;3 #BringHomeTheExperts"}, {"id": "1453239100992065542", "text": "Thanks to @urbancompany_UC professional Jitin for providing such a great Salon for Men experience. Given their safe and hygienic services, would not want to step out at all! Happy customer &lt;3 #BringHomeTheExperts"}, {"id": "1425403898265673733", "text": "I got a Men's Grooming service from @urbancompany_UC today. Sandeep did a fab job and followed all the hygiene steps. I felt safe and at ease getting services done at home. Great job Sandeep and hope you win the UC Safe Badge! #BringHomeTheExperts"}, {"id": "1453019074653405196", "text": "I am really impressed with the @urbancompany_UC professional Manish. They offered a safe and hygienic Water Purifier service. Recommending Manish for the UC Safe Badge! #BringHomeTheExperts <https://t.co/pu6xlaWfFk"}, {"id": "1425431068816003080", "text": "Thank you @urbancompany_UC for the great Full Home Cleaning service. First was a thorough professional who followed all Hygeine and safety norms. Keep up the good work and hope First wins the UC Safe Badge! #BringHomeTheExperts <https://t.co/ikJUIoeY4R"}, {"id": "1418112077856608256", "text": "I booked a Salon service from @urbancompany_UC. Kuldeep sanitised every tool before starting! The service was fantastic and very hygienic. I recommend Kuldeep to win the UC Safe Badge! #BringHomeTheExperts"}, {"id": "1452932682447396866", "text": "The Washing Machine service from Urban Company is really effective. The technician followed all safety protocls and did a great job! Happy to nominate them for the UC Safe Badge! Thanks @urbancompany_UC #BringHomeTheExperts <https://t.co/9XrsnwhLx1"}, {"id": "1503939307274321920", "text": "@urbancompany_UC @urbanclap terrible service, your technician installed a faulty part and spoilt my #IFB washing machine, new technician says #urbanclap not paying me hence I can’t work ! Poor atrocious service #consumerprotection #ConsumerRights"}, {"id": "1503674388788695042", "text": "@urbancompany_UC after repeated follow up no service provide for urban company appliance protection plan complete scam ?? Or unprofessional service provider"}, {"id": "1513734724035907586", "text": "@urbancompany_UC by refund I mean pertaining to the cancelled order. I think three weeks is alot of working days. There is no proper customer care number to contact you. I would never suggest @urbancompany_UC to anyone especially prepaid services. Worst experience ever!!"}, {"id": "1425381900697235456", "text": "@urbancompany_UC Why do you ask for an advance payment and then the amount gets stucked and it shows cancelled Is it a new trend to rob from people"}, {"id": "1425687748384411658", "text": "I booked a \" Move in deep cleaning\" from @urbancompany_UC for Aug 4, but he didn't show up and I received a call from their end that I will get a refund, but my money is still not credited to my account."}, {"id": "1452897370224488451", "text": "@UC_Assist @urbancompany_UC how do you know what is my registered number? Anyway, I have sent a DM and I expect a call today. The complaint was raised on the 12th and it has been 2 weeks with no follow up from your team <https://t.co/BkC4i2Yl2k"}, {"id": "1487268646548226049", "text": "@UC_Assist @urbancompany_UC what u think the customer will just keep waiting when your so called professional will not even pick the call and then customer need to bear cancellation fees also. Do u have any customer care service or attitude??"}, {"id": "1452979333002248192", "text": "@urbancompany_UC Guys your Customer care executive called me. Saying I'll get the work done soon, since then no communication again:man-facepalming:"}, {"id": "1453250851749965833", "text": "@urbancompany_UC stop making a fool out of yourself and the customer. If you can't afford to fulfill the services stop accepting the requests then."}, {"id": "1503972348667445248", "text": "@urbancompany_UC @abhirajbhal Awaiting for a callback since yesterday! Are you guys bothered for your customers' feedback? Terrible experience with one of your services opted."}, {"id": "1487304843278446593", "text": "@urbancompany_UC Very embarassing that you have not provided service and not taking complaint, very shameful"}, {"id": "1452960935031672832", "text": "@urbancompany_UC pathetic Service by urban company. Professional assigned denied Service at the last Moment and cancelled the Scheduled Service. To add to the agony Urban company claims the opposite. As UC grows it seems UC has forgotten to Act for customer satisfaction. extremely disappointed."}, {"id": "1503785288367149056", "text": "@urbancompany_UC"}, {"id": "1503961175184199681", "text": "Pathetic customer experience by @urbancompany_UC. Repeated complaints that professional are refusing to provide the job. Got two cancellations in two days..False promises from customer executive..all unresolved. @UC_Assist @urbancompany_UC"}, {"id": "1453215643709292544", "text": "@urbancompany_UC is the biggest example of customer experience failure…they have repeatedly been successful on delivering pathetic service"}, {"id": "1452978301622910983", "text": "@UC_Assist @ra9z @urbancompany_UC See the level of poor service. I was told I will be called and no one did till now. Another day has gone by."}, {"id": "1373167968880791553", "text": "@urbancompany_UC⁩ @UC_Assist⁩ no one called yet pathetic service <https://pbs.twimg.com/media/Ew54_J8VkAIwtKm.jpg"}, {"id": "1452985384619503629", "text": "@urbancompany_UC 1/2 I have booked a service from UC(Membership) for the date 23oct 2021. But they cancelled at the end moment of the day on which I was supposed to get service and asked me to reschedule for 25oct(it was no use for me). What a service!"}, {"id": "1513511537943613441", "text": "@urbancompany_UC booked an appointment today for 5pm. Professional reached at 4.40 without any prior intimation. When i told her she should have called coz i had to rush back coz of her, she rudely packed and left at 4.53pm. UC had no empathy for my lost time or missed service"}, {"id": "1513489659241775105", "text": "@urbancompany_UC Fraud urban company. No one call back even after 1000 of 15 min waiting slot . All the foolish guys sitting there and enjoying the frustration level of constomers. Even after executive committement , professional charged extra amount. no call back after complaint"}, {"id": "1513730008149233666", "text": "@UC_Assist Where is your resolution? Are you hiding instead of providing service? But, you from @urbancompany_UC got practice to abuse customer. @jagograhakjago - FYI &amp;A"}, {"id": "1425674243627311104", "text": "@UC_Assist @urbancompany_UC This has happened for the second time. Disappointing"}, {"id": "1453227065453551625", "text": "@urbancompany_UC very poor experience. Vendor denied service after being late by 2 hours and no resolution from your side!"}, {"id": "1513733618593456130", "text": "I had ordered a service from @urbancompany_UC almost three weeks ago. Due to unavailability of the staff they didn’t fulfill the order and the service was cancelled. I had bought UCplus membership still there was no benefit.I still haven’t received my refund. Look into the issue."}, {"id": "1418142850772922374", "text": "@UC_Assist Reminder on my complaint @urbancompany_UC @UC_Assist"}, {"id": "1453004668934803461", "text": "@urbancompany_UC Pathetic experience no one turned up and now simple sorry. This is way we are getting treated at urbanclap @urbanclap @urbancompany_UC <https://t.co/4PMGsgUAEB"}, {"id": "1425457036712583170", "text": "@UC_Assist @urbancompany_UC the horrors of this service is not coming to an end. This is regarding service done on Monday at 10 am by ratan pradhan The professional did an extremely bad job. Based on that I opted for claiming a revisit request. Cont."}, {"id": "1453065265202225156", "text": "@urbancompany_UC I booked UC service appointment wherein UC Club membership was added by mistake.I cancelled the booking immediately but the refund processed after deducting this fee which is not a fair practice being followed by UC."}, {"id": "1425452249266810882", "text": "@urbancompany_UC I am suffering because I took UC service. I complained but no action has yet been taken. This is pathetic. No ownership… no accountability… why should we pay premium prices for such services?"}, {"id": "1453205155789225984", "text": "@UC_Assist @urbancompany_UC @urbanclap Further she gave 7 days to repair post which @urbancompany_UC will not entertain the claim, how does UC expect a consumer to absent from work and get the floor repair done so soon @abhirajbhal"}, {"id": "1425686682775408643", "text": "@urbancompany_UC Horrible experience. Cleaning person canceled at last moment. UC only arranging refund, no replacement or customer support. Will never try it again"}, {"id": "1513422943753478148", "text": "@urbancompany_UC started as such a promising but they are now at the mercy of the limited professionals they have registered. 3 times the professional has not turned up and is not reachable for me nor #urbancompany #CustomerService team but they continue to be part of the system"}, {"id": "1452959667508760576", "text": "@UC_Assist @urbancompany_UC Day14 Update: Another day gone, Seems zero accountability, 48hours since last update and waiting. How long is UC planning to penalize the customer for their mistakes ??"}, {"id": "1513746613549813761", "text": "Pathetic to note that @UC_Assist completely ignored my query. Won't be buying their membership ever again plus my local technicians are much better than the untrained guys of @urbancompany_UC"}, {"id": "1513756599000903681", "text": "@urbancompany_UC @UC_Assist Part 1 - I am just disappointed with the service you have provided me. It's below par even than the unorganized sector standards. Your technicians don't turn up. Your support staff keeps escalating issues but no resolution is given to the customers."}, {"id": "1425659436677308421", "text": "@urbancompany_UC @UC_Assist @urbancompany_UC @inside_UC Great support team! My issue was immediately taken care of and they helped me through the booking! Thanks a lot! #kudos P.s - The tech issue still remains though!"}, {"id": "1452899435663409156", "text": "@UC_Assist Your team did contact us and apart from just saying \"Sorry\" there was no resolution. @urbancompany_UC does not resolve any issue. Just to be good on social media, they respond. They continue to hire people with less pay and no skill which ruins the planning and day of users."}, {"id": "1487266620318040067", "text": "@urbancompany_UC @UC_Assist how slow are your services that the matter is not resolved. This purely cheating with those who have taken subscriptions."}, {"id": "1513748020902301697", "text": "@urbancompany_UC their is ntng urban abt this company anymore. Highly unprofessional and untrained staff and the customer care has no clue about anything."}, {"id": "1453253332659838980", "text": "@urbancompany_UC Worst customer service. No call back in 2 hours when the waiting time was 15 mins only. It's going to be 2 hours and no call back.. now the professional is about to leave still my issue is not resolved. <https://t.co/0wOuMpkjMj"}, {"id": "1425439800132210695", "text": "@UC_Assist I am trying to cancel the service and it isnt showing any option to cancel and when will I get my refund @urbancompany_UC"}, {"id": "1513434879928991744", "text": "@urbancompany_UC who the hell gave you rights to resolve the complaint?"}, {"id": "1453025990884528131", "text": "@urbancompany_UC Pathric service. You first damage my AC and no one even bothers to call and fix it. No customer service to reach out to. #helplesscustomer #horriblexperience @consumerforum_"}, {"id": "1425704004957315072", "text": "@UC_Assist @urbancompany_UC"}, {"id": "1418213219059986438", "text": "@urbancompany_UC YOU GUYS ARE NOT JUST BAD AT YOUR SERVICE, YOU GUYS ARE WORST, THE ONLY BEST THING YOU CAN DO IS PROVIDE SHIT SERVICE. WORLD CLASS PATHETIC SERVICE PROVIDER - URBAN CONPANY"}, {"id": "1425672824547545094", "text": "#FuckSayNoToUC @urbancompany_UC @UC_Assist"}, {"id": "1503683303810822147", "text": "@urbancompany_UC booked an A/c service , the technician damaged my furniture! Urban Company setting the standards very low for themselves!"}, {"id": "1418446769424306179", "text": "@urbancompany_UC Same story repeated again. Now what?"}, {"id": "1503786894387081216", "text": "@urbancompany_UC booked ac service half an hour ago but even when the money is deducted the service is not booked. Sharing screenshots in message box. Please resolve!"}, {"id": "1418169829723308038", "text": "@UC_Assist @urbancompany_UC I have sent 3-4 mails regarding the service and refund but no update."}, {"id": "1425359502765805573", "text": "@Eepsita @urbancompany_UC Seems like they (UC) allegedly put unnecessary penalty on them which reduces their earnings. A few tweets regarding the same were done in last 48 hours. Search for \"urban company penalty\""}, {"id": "1425664269727633408", "text": "@urbancompany_UC I have a salon service booking that was scheduled for 7.30 AM 12th Aug 2021, but the service request is not yet assigned to any executive and there is no update by Urban Company on this. Please look into this right away or refund my money. Pathetic service by UC"}, {"id": "1418113509871611911", "text": "@urbancompany_UC Stop fooling people...please never call anyone from urban company .. <https://pbs.twimg.com/media/E64muKNUUAM4tGj.jpg"}, {"id": "1503706744999976960", "text": "@urbancompany_UC a service scheduled for 4PM didn't happen as the assigned professional didn't turn up. I raised an issue for same on the app but didn't get any call back. Payment is already done. Pls cancel the job from your end and refund amount! <https://t.co/o8G1NxGlwm"}, {"id": "1452951312493015040", "text": "@UC_Assist Hi Team, My Booking is pending professional assignment since 23 Oct and not getting any conclusive response. No feature in app to call customer care @urbancompany_UC how to reach support ?"}, {"id": "1453015011073433605", "text": "@UC_Assist @urbancompany_UC @ra9z Completely false! No one is in touch with me. I never got any call nor any email. What is happening? Are you just waiting for the warranty period to get over and then deny service? Is this some ploy?"}, {"id": "1453196874697961474", "text": "@urbancompany_UC booked service for today 8 am. Professionals not arrived yet and not able to track them via app either."}, {"id": "1453027050944548866", "text": "@urbancompany_UC do customers even matter? Or is it just about getting the money. I have tweeted twice in the last 48hrs but to no avail. You have taken my money and wasted my time. I have not heard from any of your representative. The worst service possible. Horrible pathetic."}, {"id": "1453215956772130816", "text": "@urbancompany_UC is the perfect example of dissatisfaction for any customer… #boycotturbancompany"}, {"id": "1487025563210555398", "text": "@UC_Assist @urbancompany_UC had around rs 1000 UC credits in my a/c with club membership... But due in covid times, it got expired... Now wen i wanted to use URBAN COMPANY for services... UC credit expired... Also the membership.. Please help.."}, {"id": "1503939903020679168", "text": "@UC_Assist @urbanclap terrible service, your technician installed a faulty part and spoilt my #IFB washing machine, new technician says #urbanclap not paying me hence I can’t work ! Poor atrocious service #consumerprotection #ConsumerRights @urbancompany_UC"}, {"id": "1503682851048685573", "text": "@UC_Assist @urbancompany_UC can I have deadline"}, {"id": "1418164535995748352", "text": "@UC_Assist @UC_Assist I have not received any calls from you. I am waiting for your calls. Please arrange a call back @urbancompany_UC"}, {"id": "1503679871758655488", "text": "@nmanaktala @urbancompany_UC @ra9z @abhirajbhal @varunkhaitan @ETtech Confirmed bookings, adv payments, waiting for the full day, call from exec 'sorry maam' and cancellation. Result- a wasted Sunday, a wasted tuesday (unfortunately took Leave) and 5.5k+ resting with @urbancompany_UC. Yes superb buss model &amp; splendid service. Thx 4 ruining my days. <https://t.co/bK7CmjkjjA"}, {"id": "1513434735586213888", "text": "@urbancompany_UC what the hell is wrong? You marked my complaint clised without resolving that … i will drag you to consumer court"}, {"id": "1425624026748051456", "text": "@UC_Assist I booked for full home cleaning services for 9:30am today. But the 2 professionals I was being assigned had not so high ratings. This is several hours project that needs to be done well. Plz assign good professional company. And no number to call you! @urbancompany_UC"}, {"id": "1503702722024935424", "text": "Never choose @urbancompany_UC as your service partner. They will send extremely unprofessional service provider who will damage your home and moreover you will not receive any compensation too. @housejoyindia @abhirajbhal"}, {"id": "1425496692196007954", "text": "@urbanclap what’s ur helpline number? Need to file a complaint for Bhopal. @urbancompany_UC"}, {"id": "1513540518579359744", "text": "Surprisingly...i didn't get any call still.. @urbancompany_UC"}, {"id": "1453199628002742277", "text": "18 Days passed @UC_Assist @urbancompany_UC . No news of your team or the part taken for repair"}, {"id": "1513761538804715522", "text": "@urbancompany_UC @UC_Assist Part 6 - Now this was escalated again after your support staff contacted me again. And the same technician was assigned again for the service at 11:30 am on 10th April, 2022. He did not show up then as well."}, {"id": "1418254134973657088", "text": "@urbancompany_UC We have taken a service from your urban company on 18th of July of Ac servicing but the service was pathetic . ServiceMan Mr.Sujeet Rana damaged our A.C.and took the part with himself in order to repair it and there’s no response from your side till today."}, {"id": "1452953247983931393", "text": "@UC_Assist @UC_Assist @urbanclap @urbancompany_UC it's been 4 hours and still no calls. Been over 10 days no action. @timesofindia @htTweets @NavbharatTimes @EconomicTimes"}, {"id": "1513748015747502081", "text": "@urbancompany_UC if you can’t send your technician on the day it was scheduled then why the hell you take our cash as advance now give me urban credit in my account for your fault"}, {"id": "1418418435050987522", "text": "@gurumvg @urbancompany_UC These things keep happening..."}, {"id": "1513544335262126081", "text": "UC team there is a serious concern from a service category(packers and movers) please do start the packers and movers category again. They were deserving service providers who matched UC Requirements. #urbancompany @UC_Assist @urbancompany_UC @abhirajbhal @inside_UC <https://t.co/1eWzzNoRd5"}, {"id": "1425483401423818756", "text": "How to connect with customer care executive of @urbancompany_UC Any leads??"}, {"id": "1513762752976027650", "text": "@Biorahul @myvoltas @urbancompany_UC UC is the best for AC servicing."}, {"id": "1487324267540725760", "text": "@artijourno the story around @urbancompany_UC suing protesting service providers just faded away. Has the company put pressure on journos to not cover the story? @chandrarsrikant @entrackr"}, {"id": "1503980413181898754", "text": "@urbancompany_UC when your professional can't come on time &amp; ask us to cancel,why you penalise us by defucting our money."}, {"id": "1418131982366613505", "text": "@urbancompany_UC @urbancompany_UC We had booked the platinum service &amp; the assigned supervisor never visited spoiled our carpet, never brought the floor cleaning machine job completed on 7 th july your executives closed the complaint without investigating. M 9920063123."}, {"id": "|Urban Company> retweeted", "text": "@urbancompany_UC am mighty impressed by the AC service provided today. Everything was done so cleanly, not a speck… <https://twitter.com/i/web/status/1503692552137940994"}, {"id": "1503964681764892674", "text": "@urbancompany_UC is doing quackery services beware in name of SPORTS MASSAGE"}, {"id": "1513421157621702659", "text": "@urbancompany_UC cheater company dont believe him. Never trust this company. Always take money but services not fullfill."}, {"id": "1425662139063160832", "text": "@UC_Assist @urbancompany_UC Can you look into this? No technician assigned yet."}, {"id": "1418382798872715272", "text": "@urbancompany_UC @ra9z @kanavarora Very bad urban company"}, {"id": "1452965001279328256", "text": "@urbancompany_UC Worst service from Urban company, from three days your not able to assign a carpenter for my booking. Worst experience"}, {"id": "1418169491440078849", "text": "@urbancompany_UC What is the way to contact you for complaints..I have sent 3-4 mails but no response from your <https://t.co/xrvSMBuGAR you have customer care team ?"}, {"id": "1452962143121260554", "text": "@urbancompany_UC need ur help asap how to contact u plz"}, {"id": "1425457912080527365", "text": "@urbancompany_UC @UC_Assist there is no way to talk to a customer care. Different people call with no solution. Please look into this matter"}, {"id": "1425516956438863873", "text": "@UC_Assist Does @urbancompany_UC have ethics at all to commit so much &amp; give negative services inspite of taking hefty charges 4m customers @abhirajbhal @ra9z Get the chimney replaced now @ayushmannk @kritisanon Plz don't associate with brand which mistreat customers,we pay &amp; get exploited"}, {"id": "1425357696337801221", "text": "anyone know what this is about? @urbancompany_UC"}, {"id": "1425471329990369284", "text": "@urbancompany_UC please help me with an issue here."}, {"id": "1487331573884067845", "text": "@urbancompany_UC Requested disinfection services for 29Jan 1PM. 12.45 I call and get to know that you can't provide the service. Payment upfront but commitment a big ZERO!! Now rescheduled to 30Jan 8AM and still no professional assigned! Is there any real commitment?"}, {"id": "1418165008505085956", "text": "Has anyone heard of a @urbancompany_UC insurance ? Please be AWARE they are CHEATS. Apparently that insurance can never be claimed. Would appreciate it if @MumbaiPolice investigates this fraud"}, {"id": "1453245774070960134", "text": "@UC_Assist @urbancompany_UC Day 15: Status Unknown, ETA Unknown, Callback Unknown. Why isn’t anyone calling and giving me an update? That’s the least I expect. Zero control and zero professionalism. You should add a disclaimer “Book service at your own risk”."}, {"id": "1418231135872569353", "text": "@urbancompany_UC still not able to use your app."}, {"id": "1425704125111537666", "text": "@abhirajbhal @urbancompany_UC @UC_Assist"}, {"id": "1425704215498743812", "text": "@abhirajbhal @urbancompany_UC @UC_Assist"}, {"id": "1513763456146874368", "text": "@urbancompany_UC @UC_Assist Part 9 - Now I am fed up. I want my AC repaired by tomorrow or I am going to exercise my legal rights against the harassment I faced. Rest assured. I will do this."}, {"id": "1513740509847912448", "text": "@urbancompany_UC : This is highly unprofessional . No customer care call on complain. No agnet assigned to repair one hour before appointment. This is a big disappointment by Urban Company , you are not able to provide proper service in Raipur. #urbancompany"}, {"id": "1453162841683288067", "text": "Lesson learnt. Never ever book a painting service from @urbancompany_UC . Pathetic service. They took all the payment a week ago, n didn't start the work. Irresponsible customer service handle grevience, on top of that. @UC_Assist"}, {"id": "1503656705523036162", "text": "@urbancompany_UC Your service is the worst. I just don't have any way to reach you guys for even raising a issue with the booking forget getting a issue sorted!!!!"}, {"id": "1425367151003590658", "text": "@akshaytayade122 @urbancompany_UC It is for the 4th time, that we have not been assigned a professional. And we have got no call yet. If it is not possible for you guys to assign someone, why are you giving false promises. Really very pathetic and frustrating experience. Membership of no use"}, {"id": "1418449561815855107", "text": "@UC_Assist It’s almost a month now and my issue is still open . You did lot of mental harassment and exploited my time and money . @jagograhakjago @urbancompany_UC"}, {"id": "1418123487466688515", "text": "@warikoo @businessbarista @urbancompany_UC How urban company solved disintermediation problem ??"}, {"id": "1513762472272199683", "text": "@Dipesh1987Jain @urbancompany_UC @UC_Assist Lol...urban flop is there new name ...i have stopped wasting time on these idiots"}, {"id": "1503980934047371264", "text": "@urbancompany_UC when your professional can't come on time &amp; ask us to cancel, why you penalise us by deducting our money. <https://t.co/gWQiHpvg9b"}, {"id": "1453035095007191044", "text": "@UC_Assist @urbanclap @urbancompany_UC @timesofindia @htTweets @NavbharatTimes @EconomicTimes It's been more than 10 hours now and still waiting to receive the call. Project left unattended, calls left unattended, refund &amp; compensation left unattended. Strange service promises"}, {"id": "1513726166779281411", "text": "@urbancompany_UC raised to claim warranty multiple times but not getting satisfactory response from your end."}, {"id": "1425703882018025476", "text": "@urbancompany_UC @UC_Assist @abhirajbhal"}, {"id": "1503694667204165637", "text": "@krazyrupz @urbancompany_UC Sounds great"}, {"id": "1513729728192344070", "text": "@urbancompany_UC your executive won’t let anyone else take my booking and is already 30mins late for my 9AM service. I have a job and cannot wait forever for him to come. I am still waiting for you customer care to call me even though I’ve complained almost 30mins back. <https://t.co/Qg1qWcAUsW"}, {"id": "1487285684175998976", "text": "@urbancompany_UC is claim warranty and callback support is sham? I am unable to reschedule and getting error and without getting a call got a messge that you couldn't reach me. My appliance might be damaged by your team I am sharing my contact details in your DM"}, {"id": "1425393539156873219", "text": "So @urbancompany_UC calls itself as a safe service provider. They are not. AC service man they assigned was constantly coughing on call. I cancelled the booking as I don't want anyone coughing to enter my home. #UrbanCompany is not at all safe for your family in #COVID19 times <https://t.co/nPy9EL5tfX"}, {"id": "1425490251531780104", "text": "@madebykartikay @urbancompany_UC All the best"}, {"id": "1513756862818095105", "text": "@urbancompany_UC dear urban company if u are incompatible to provide service then plz close ur app, and do not offer any customer to take yearly benefit scheme. U take money and then refuse to provide service and when we raise the question u call again again for no reason."}, {"id": "1452951976359063553", "text": "@urbancompany_UC I advise people to not use urban company for painting services. Experience is pathetic."}, {"id": "1513466977511424000", "text": "@urbancompany_UC very unfortunate that you are promoting who did wrong practices and cheated your customers. This will certainly hit your brand image. Even after given written complaints and proof you didn't take any action against him."}, {"id": "1452903502083092484", "text": "@urbancompany_UC This is the second tweet I'm addressing to the portal. The professionals have arrived 4 hours late, without proper precaution gear. They have denied services and have left. URGENT!"}, {"id": "1513606562945720320", "text": "@urbancompany_UC @jagograhakjago @PMOIndia @UC_Assist UC your technician are unprofessional and fraud. Charged double the amount, changed correct AC part, without checking leakage filled gas and charged money. Pls refund my money and sack the fraud person."}, {"id": "1453197870195044363", "text": "Want to know what you concluded about the complaint made by me. @abhirajbhal @urbancompany_UC"}, {"id": "1503956508916137988", "text": "@debiprasadss @OlaElectric Call someone from @urbancompany_UC"}, {"id": "1513586080359993345", "text": "@urbancompany_UC If you do not want to honor the Warranty then why are you committing this fraud on customers? You should be dragged to consumer court and you will be."}, {"id": "1513759657307033601", "text": "@urbancompany_UC it’s been 4 days no one has solved my issue!"}, {"id": "1425667486746173443", "text": "@urbancompany_UC Dear @urbancompany_UC How I can dm there is no any option for dm"}, {"id": "1425668189497688065", "text": "@urbancompany_UC Dear @urbancompany_UC how I can dm there is no any option for dm"}, {"id": "1453211642569707521", "text": "@urbancompany_UC no contact information . I need some help. Need or understand the package I have choosen"}, {"id": "1453200897538859009", "text": "Received a call telling they are also not able to track the professionals !!! Highly disappointed @UC_Assist @urbancompany_UC"}, {"id": "1513450659626237958", "text": "@urbancompany_UC all of my massage booking always end before the scheduled time. Why is it so?"}, {"id": "1425426897727475721", "text": "@urbancompany_UC Your services in Hyderabad just sucks!! I was a huge fan and loyal customer ( big spender as well) of your services in Mumbai and Kolkata. But in Hyderabad, everytime I have booked your services - I have been disappointed with the quality of services here."}, {"id": "1513444987899637763", "text": "@RomaanaAamir book on @urbancompany_UC !"}, {"id": "1425426769104965634", "text": "@urbancompany_UC the professional assigned to me is not feeling well and requested me to reschedule, however I can't reschedule due to other constraints. Could you please assign the task to another professional ?"}, {"id": "1452894112009490433", "text": "Urban company support team, why are you ignoring a complaint raised against the work doen by one of your professionals in varanasi. The person was rude and arrogant and didn't performed his work effectively. @urbancompany_UC"}, {"id": "1503645072872640514", "text": "@virajg_ bad luck, maybe @urbancompany_UC guys can help you."}, {"id": "1425677519332642822", "text": "@urbancompany_UC how do I connect with you on call? Urgent. Nobody is answering the number on google"}, {"id": "1503755181988904962", "text": "@urbancompany_UC what is this behaviour? <https://pbs.twimg.com/media/FN5pXOvagAId6Rv.jpg"}, {"id": "1503757018217480192", "text": "@urbancompany_UC How do I redeem a service for which I have paid? Please contact me."}, {"id": "1513740238988148738", "text": "@urbancompany_UC : This is highly unprofessional . No customer care call on complain. No agnet one assigned to repair one hour before appointment. This is a big disappointment by Urban Company , you are not able to provide proper service in Raipur."}, {"id": "1453250504457396227", "text": "@urbancompany_UC if you can't fullfill the services please don't accept orders and fool the customer. I requested for today's service which was scheduled for 10 a.m today and still waiting for the person. And my other order was for 12 p.m and he's still working somewhere else"}, {"id": "1503979633024598017", "text": "@debiprasadss @OlaElectric @urbancompany_UC Generally @bhash responds."}, {"id": "1513762000169746436", "text": "@urbancompany_UC @UC_Assist Part 7 - Again I had to raise the issue and again a revisit from the same technician was scheduled for today morning at 10:30 am. He didn't turn up yet again. I tried calling but no one picks up the call."}, {"id": "1513550291685163009", "text": "Third class service by @urbancompany_UC Waited all day for your technician but no response. No reverts either on the complaints raised. @abhirajbhal 230pm appointment moved to 6pm and then still no one came and neither am i getting any assurance. #severedelays #badexperience <https://t.co/gj9IqYrZFb"}, {"id": "1503754767369408513", "text": "@urbancompany_UC what is this behaviour? <https://pbs.twimg.com/media/FN5o_FVaQAEH4Qm.jpg"}, {"id": "1453204572508340228", "text": "@UC_Assist Disha Sharma Manager @UC_Assist called today morning. Asked to repair the floor and submit GST invoice of repair. It is impractical for @urbancompany_UC @urbanclap to ask a consumer to find a labour for repair and that too with GST registration. 1/2"}, {"id": "1503908372151644163", "text": "@urbancompany_UC zip chirigindi"}, {"id": "1425486190145249282", "text": "@UC_Assist @urbancompany_UC @UC_Assist Another day, another follow up. I have now provided you with all prescriptions as requested and am left with no platform to even as much track the progress of my complaint? Will await a call back by tomo latest. Funny how I have to resort to Twitter."}, {"id": "1513765850607939584", "text": "@susegado4all @urbancompany_UC @UC_Assist @susegado4all @urbancompany_UC @UC_Assist They are free to be whomever they want to be just not at the expense of my money and mental peace."}, {"id": "1453064692268605440", "text": "punctuality issues. I don't know how this is going to end but either way this would be my first and last time with this company. Absolutely unprofessional services and certainly worth the money or time. @urbancompany_UC"}, {"id": "1487314713646039040", "text": "@urbancompany_UC Please stop spamming us non-stop for feedback. Repeated messages on email, phone WhatsApp will ensure I never take your services again #dnd #spam"}, {"id": "1418463430470602753", "text": "@ra9z @urbancompany_UC Fraud Company ka phone nhi aaya <https://pbs.twimg.com/media/E69k9icWUAMSGWr.jpg"}, {"id": "1513529328923209730", "text": "@UC_Assist @urbancompany_UC @abhirajbhal Urban clap has called me once in the last week when I was in a meeting and has told the technician I am not picking up their calls. The technician has been calling me incessantly and threatening me, I have recordings now. #CustomerService will someone please respond."}, {"id": "1452945348226260992", "text": "Urban company is really going to an indian Fraud Company. Concern for Money has been raised on 18th October, till now there is no response. Twitter account making fake promises. Fraud UC. @abhirajbhal @inside_UC @UC_Assist @urbancompany_UC @UrbanCompanyKSA @RNTata2000"}, {"id": "1425354484222291968", "text": "@urbancompany_UC @UC_Assist pathetic cleaning services provided... absolutely useless app...I want my money to be refunded...all r theives"}, {"id": "1487117017777795072", "text": "Today is #DataPrivacyDay. @urbancompany_UC is committed to implement global standards when it comes to protect user data. From today,user will be able drop an email to privacy@urbancompany.com to get what personal data we have stored on our servers and delete it user want."}, {"id": "1503630270863319040", "text": "@Candid_HRavi @urbancompany_UC Yessss!"}, {"id": "1513762954055135232", "text": "@urbancompany_UC @UC_Assist Part 8 - Now after 2 weeks of escalations I have no resolution. Every time I request a call back, the app says that I'll get a call in 15 minutes but I do not get a call back on the same day. I am fed up and after paying I have a damaged AC."}, {"id": "1513547717892472832", "text": "@RelianceDigital Another shining example of incompetence! My AC was repaired after I made a booking on @urbancompany_UC. All your org did was make calls to us but not provide a single resolution. <https://t.co/H0B1NsL2yB"}, {"id": "1425699076012531712", "text": "@urbancompany_UC I had to reschedule carpenter for 3 straight days missing my doctor appointment waiting for your executives. They don’t lift the calls, thank you for making me buy your subscription on top of that. <https://t.co/ONa3Y0TTS6"}, {"id": "1503738383822061570", "text": "@UC_Assist @urbancompany_UC @abhirajbhal can you please help"}, {"id": "1513766538582450178", "text": "@Biorahul @myvoltas @urbancompany_UC I hope you didn't pay him for imaginary gas leak/other defects which is UC's SOP. Also check if your wallet/mobile charger is not missing."}, {"id": "1418284153095614467", "text": "@urbancompany_UC My uc rewards have expired in lockdown i have dm the screenshots. I have tried booking multiple times prior it stated unserviceable in your pincode. Kindly refund back the wallet rewards"}, {"id": "1453100251703775237", "text": "@GautamBalaji4 @UC_Assist @urbancompany_UC @inside_UC @abhirajbhal @RNTata2000 Urban company is not serious with his partner's issues, i have also panelized many more times and i have raised complaints many times and they said \"we can't help you, we don't have access\" ye sab kahte hain chahe barish ho ya aapki activa kharab ho jaye aap khud zimmedar ho."}, {"id": "1503635282541035522", "text": "@urbancompany_UC Worst service I could have ever imagined! Even though I had mentioned I have a very sensitive skin, you guys gave me a pathetic “wine facial” which ruined my face!! My entire face was horribly swollen the next day. I was unable to even keep my eyes open"}, {"id": "1453003446659997704", "text": "No remedy... Big shame to @urbancompany_UC"}, {"id": "1513748100380512256", "text": "@urbancompany_UC Technician (1 dose vaccinated) didn't complete job, said compressor went bad. No tools to check and will come back, closed ticket. Refund given as UC credit not to my card. Support asked bank details. #poor #CustomerExperience #urbancompany #Hyderabad #Telangana <https://t.co/Rzk7i4jYtG"}, {"id": "1513548747292266497", "text": "@urbancompany_UC booked a chef on your app. Your customer support called, asked to move the slot. I agreed. Then you guys cancelled the booking without informing me. And no word on the refund and no revert from your support. What. Is. Going. on!!"}, {"id": "1513455100664369155", "text": "Hey @urbancompany_UC When will your technician come? Appointment was for 230pm !! #delays #nocommunication #unprofessionalism"}, {"id": "1503630012901396481", "text": "@krazyrupz @urbancompany_UC Ahaan free service kya"}, {"id": "1452921604934045697", "text": "@NARESHA12470950 @urbancompany_UC Hi Naresh, We're really sorry you’re experiencing this problem. I’m sure we can figure this out, and our team will work on finding a solution right away!"}, {"id": "1453180119837642757", "text": "@YourStoryCo @abhirajbhal @gupshup @beerud @urbancompany_UC @EruditusExecEd Loved your talk Abiraj &amp; since I have availed the services of Urban Clap , can imagine the complexities of build this company from grounds up to scale , congrats ."}, {"id": "1513766450112364546", "text": "@Dipesh1987Jain @urbancompany_UC @UC_Assist Lol...take a chill pill bro"}, {"id": "1513544649721360385", "text": "@CaVineet1986 @urbancompany_UC They are good for nothing. Local vendor is good instead #urbancompany"}, {"id": "1513655521714266120", "text": "Hey @urbancompany_UC I know you guys doing decent job but this is what happened with me during my last service.. Also wasn't going to say anything but got message for feedback yesterday so decided to warn other who might be facing similar situation and cheating.. <https://t.co/oeRYztGXqN"}, {"id": "1513531413580357632", "text": "@audiinidesign @iamjaglan @ridder_mark @ra9z @mayankd_ @urbancompany_UC"}, {"id": "1425409340467417096", "text": "@urbancompany_UC MY name is Kalpana.I had joined Urban clap.i took 5 days online class and 2 days offline <https://t.co/6PNU8Jr4Wu full payment has been deposit but I did not join. Neither my product has arrived nor my payment refund has come."}, {"id": "1452899306462081024", "text": "@urbancompany_UC 7899999625 and plz call after 11 am not at 7 am"}, {"id": "1453052006642290692", "text": "@urbancompany_UC @UC_Assist @abhirajbhal still waiting for response @jagograhakjago #consumeraffairs @consumercourtin"}, {"id": "1418239887426297856", "text": "Thanks for this feedback I was looking to hire @urbancompany_UC for my home cleaning. Now I shall reconsider my decision."}, {"id": "1513757131358760960", "text": "@urbancompany_UC Very poor service....technician never comes on time and when came said UC us putting substandard parts so pls use there parts which is originals but 3X in prices"}, {"id": "1418180151846735876", "text": "@urbancompany_UC this related to poor resolution of the feedback reg wrong diagnosis of a/c repair by urban company mechanic. Detailed feedback was given by me. Got a call from UC and was told that it will be resolved and I will be informed. However, nothings seems to have done."}, {"id": "1487052906616418305", "text": "@urbancompany_UC seems like tweeter is the only channel to reach the Urban company and express grievance. Can't claim an active warranty due to a syetematic flow.. Or is it intentional? :thinking_face: <https://t.co/2up9Ab5Bb7"}, {"id": "1513547615102959618", "text": "@ridder_mark @urbancompany_UC @figma Ohh, Time to play"}, {"id": "1503976130981756929", "text": "@debiprasadss @OlaElectric @urbancompany_UC Oh is it. I see. Good that they are sending in someone to install it. I mean they haven’t sent yet. But good they have this process defined."}, {"id": "1425497678591381512", "text": "@madebykartikay @urbancompany_UC Congrats @madebykartikay"}, {"id": "1453243847874592769", "text": "@urbancompany_UC .. Booking was done for 11 AM. Spoke to ur executive and was advised that people shall reach by 11. It is 11 45 now and no one has arrived. Cancelled the booking now and will not recommend your service to anyone!"}, {"id": "1487144082648748033", "text": "@urbancompany_UC can someone from recruitment team or human resources connect with me, having serious concern to discuss."}, {"id": "1418131217401094147", "text": "@Paytm, @GooglePay &amp; @PhonePe_ keep fighting over UPI share. <http://Housing.com is back into the house rental listings. @urbancompany_UC wants to scale salon as a category."}, {"id": "1453220074089811972", "text": "@Shyamsunder_KR @urbancompany_UC my problem is not resolve yet. my work is pending since 17.10.21. Please call me soon"}, {"id": "1418451270830944264", "text": "Very impressed with Bathroom Cleaning service by @urbancompany_UC. Bhura was outstanding and made sure to sanitise everything they touched! Surely nominating Bhura to win the UC Safe Badge! #BringHomeTheExperts <https://t.co/oGAbOESjnP"}, {"id": "1425486567242559488", "text": "@urbancompany_UC ... Bad service, false pricing trap, spamming calls during a busy work day. I feel cheated and on the brink of uninstalling the app and stop using a product I liked. :/"}, {"id": "1513420229778550788", "text": "@singha_1987 @urbancompany_UC I hope u must have got the resolution now."}, {"id": "1425413378420314112", "text": "@urbancompany_UC I tweeted the above tweet in the morning still no reply."}, {"id": "1425493198630055939", "text": "I booked a Salon service from @urbancompany_UC. Shan sanitised every tool before starting! The service was fantastic and very hygienic. I recommend Shan to win the UC Safe Badge! #BringHomeTheExperts"}, {"id": "1503957311496208385", "text": "@urbancompany_UC 20 days no reply. Such frauds @jaagograhakjago @jagograhakjago"}, {"id": "1503660856898334720", "text": "@urbancompany_UC team your professional was 1.5 hours late never bothered to call or text to explain the delay, I called him right now he said and I quote “I am Busy at another site and will not come u need to reschedule” is this the customer satisfaction your guys go for ?"}, {"id": "1418158786552860674", "text": "2- Dear @urbancompany_UC sir while I was on leave my rating automatically down by Catagory manager Yatim Juneja. Please find an appropriate solution so that I'll come to do work in Urban Clap Thank You sir"}, {"id": "1503797405321469955", "text": "But I've been waiting for them to call back for the last 3 days. How frustrated would you be if you called someone to fix your washing machine and they broke your toaster instead. Absolutely pathetic. Zero stars @urbancompany_UC"}, {"id": "1425475568410136577", "text": "@madebykartikay @urbancompany_UC Wow!! Congragulations"}, {"id": "1503975287117135874", "text": "@urbancompany_UC dear UC, I am not sure what’s the issue with your professionals they are always late, what’s the use of slot booking ?"}, {"id": "1453235357575786499", "text": "Hi @urbancompany_UC @UC_Assist i want you to please fire this guy \"Case Manager Nikhil\" from the senior team. Extremely rude and doesn't listen to the issue. Please ask anyone else other then him to call me for the same. I have all his call recordings as well."}, {"id": "1503938595035357188", "text": "@urbancompany_UC Daylight cheating happened with me from them, had given 5 star before, but need to drop the ratings below zero now. I have booked urban clap for AC uninstallation in 2020, due to corona couldn't check it until now I tried to reinstall it, again as an premium..."}, {"id": "1425482404777455618", "text": "@urbancompany_UC extremely disappointed with yours customer service team. Never gonna use Urban Company &amp; also share feedback of how customers are cheated. 4 times AC technicians visited &amp; could not fix the AC gas charge. Finally got the LG technician to come fix it."}, {"id": "1513712574222991361", "text": "@urbancompany_UC Hi, AC serviced on 27th March and it is within 1 month guarantee rcvd by urban co, started Ac after 1 week of service, got scared sounds &amp; re complain it, technician came &amp; take away the Ac on 07th April, now not getting any reply, pls help.Pic attach #8010181028 <https://t.co/o93xXmU0ru"}, {"id": "1425711079565393920", "text": "@Airtel_Presence Please help to stop this spamming from @urbancompany_UC <https://pbs.twimg.com/media/E8kkq3nUcAMZJzO.jpg"}, {"id": "1513592146426691584", "text": "@ridder_mark @urbancompany_UC @figma Thankyou!!"}, {"id": "1452950259936595969", "text": "@urbancompany_UC @UC_Assist - Can you please answer how can a customer get help if you are not responding to emails and also you are not calling after multiple callback requests are placed? Kind of hostage situation as there is no way customer can reach out to you by his own."}, {"id": "1425370468383555589", "text": "@urbancompany_UC booked a hair cut service from hair dresser whom I have used earlier. Urban company shows message that request is pending to hair dresser for acceptance. However hair dresser confirm that he has not received any booking request for that day and time...."}, {"id": "1418160049063485441", "text": "@MumbaiPolice I am being threatened by an employee of @urbancompany_UC by the name of Krishna. Please help."}, {"id": "1513484919099772934", "text": "@urbancompany_UC I wonder why you have a 60 days warranty policy when your professionals are not willing to deliver it ? One of the professionals just came to my house for a AC service deep cleaning and simply refused to do the job until and unless I pay him extra ?"}, {"id": "1513441833572962305", "text": "@urbancompany_UC it’s been more the 24hrs of waiting for a single call for an escalated issue. Ideally if you are mentioning 15 min you should follow that else change it to whenever UC feels like calling. I need to know your escalation matrix and SLAs"}, {"id": "1425443204065681413", "text": "@gariana_arande @urbancompany_UC"}, {"id": "1418191974008561666", "text": "@UC_Assist @urbancompany_UC @jagograhakjago @JagoGrahakJago_ I didn’t hear from you . Can you please update here ??"}, {"id": "1452963660259758082", "text": "@UC_Assist @urbancompany_UC I am saving screenshot of this message that we don’t need vaccum cleaner for cleaning dirty from the window side and we can use our hands to clean it. Kay baat, then how did 3 service agents confirm to me that it was Miss by urban clap. ???"}, {"id": "1418416820302741505", "text": "I booked a Salon service from @urbancompany_UC. Naresh sanitised every tool before starting! The service was fantastic and very hygienic. I recommend Naresh to win the UC Safe Badge! #BringHomeTheExperts"}, {"id": "1425446318579666956", "text": "@madebykartikay @urbancompany_UC Congratulations!:grinning:"}, {"id": "1425382619647156226", "text": "@varunkhaitan @urbancompany_UC Paid Reviw. first they will repair ur ac and intentionaly wont responce till the warranty period.. after that they will force you to maje the payment.."}, {"id": "1452972958025015299", "text": "@fervid_hindu @unacademy its @urbancompany_UC didi . glad to help"}, {"id": "1513543562176364544", "text": "@urbancompany_UC Arben company chor he"}, {"id": "1453210135925460999", "text": "@urbancompany_UC why the companu is cheating customers taking money by telling lies and showing lies on services. I booked bathrom. Intense deep cleaning for 949 but wen person came he is with ourmachine and demanding xtra. Stop lying and making fraud will take u to court"}, {"id": "1418446038818377732", "text": "Hey @urbancompany_UC, what is your customer care number. I did not find it on the app. Please revert"}, {"id": "1418145879324708871", "text": "I am really impressed with the @urbancompany_UC professional Sumanta. They offered a safe and hygienic Bathroom Cleaning service. Recommending Sumanta for the UC Safe Badge! #BringHomeTheExperts"}, {"id": "1418127776167579650", "text": "Only place where this company listens. Or at least I hope so. @urbancompany_UC . Completely disappointed, dissatisfied. Home cleaning- Unprofessional and Unhelpful."}, {"id": "1452951619750875137", "text": "It’s 4th day since last conversation with customer service. Material not picked up and refund not initiated. @urbancompany_UC"}, {"id": "1418229645548294144", "text": "@urbancompany_UC BEWARE OF URBAN COMPANY(Complaint number UC0588da854) we had a disinfectionservice which damaged TV worth <https://t.co/x9iWiv8NoG instructions and safety by UC unprofessional.for damage of 45000-55000 theyoffered10000 only which we <https://t.co/FErJR5msdH.ABISHEK"}, {"id": "1513512538100563972", "text": "@UC_Assist @urbancompany_UC @abhirajbhal Been trying to reach someone at the company for the last couple of days. The TV that was returned has issues but I am not letting the same technician come to my house or touch my television... Need help to sort this #CustomerService #horrible"}, {"id": "1425416263136776194", "text": "I booked a Salon service from @urbancompany_UC. Sharda sanitised every tool before starting! The service was fantastic and very hygienic. I recommend Sharda to win the UC Safe Badge! #BringHomeTheExperts"}, {"id": "1513711135903535106", "text": "@urbancompany_UC 1 month To Compline raise Not Any Solve My Isue please Solve My Isue"}, {"id": "1425366294417731585", "text": "Salon at Home from @urbancompany_UC is safe and hygienic. Their beautician Asha is really good. She had all the branded products and disposables to deliver safe services. Nominating Asha for the UC Safe Badge! #BringHomeTheExperts"}, {"id": "1425407426522599430", "text": "I booked a Salon service from @urbancompany_UC. Venu sanitised every tool before starting! The service was fantastic and very hygienic. I recommend Venu to win the UC Safe Badge! #BringHomeTheExperts <https://t.co/3utBacsQ6f"}, {"id": "1418451122201587714", "text": "I am really impressed with the @urbancompany_UC professional Sai. They offered a safe and hygienic Bathroom Cleaning service. Recommending Sai for the UC Safe Badge! #BringHomeTheExperts <https://t.co/PGAGuabKqT"}, {"id": "|Urban Company> retweeted", "text": "9 months, 10k hrs and it's finally ready! Everyone, introducing you to Align - @urbancompany_UC's design system, a… <https://twitter.com/i/web/status/1513557835170283523"}, {"id": "|Urban Company> retweeted", "text": "@urbancompany_UC My personal chef experience on urban company has been amazing so far. Started with a one day trial… <https://twitter.com/i/web/status/1452898511347875841"}, {"id": "1452912968048340997", "text": "@Shyamsunder_KR @urbancompany_UC What are the charges like ?"}, {"id": "1487008953485733888", "text": "@urbancompany_UC - I have been using your services for a long time but since 2020 there has been constant decline in your ways and means of providing services. Your beauticians don't respond to calls/msgs, they don't reach on time, they don't deliver professionally. What's wrong?"}, {"id": "1503693894139068418", "text": "The executives arrived well before the scheduled time, had all the necessary equipment, took a lot of time and effort on each of the 5 ACs, and ran thorough checks to ensure service was done perfectly. @urbancompany_UC keep it up! :100::heart:"}, {"id": "1513769184395612163", "text": "@urbancompany_UC do u employ the real technicians?I doubt that.Ur technician has broken my <http://AC.it’s not running post service. And ur support is not giving me a call?? It’s second instance in a row. I have not received any call yet.@BandBajaateRaho #worstservice <https://t.co/mBCluVpqXT"}, {"id": "1425641253325074436", "text": "@urbancompany_UC You promised me something to keep my mouth shut but now nobody is responding from your office staff.Dont want to tarnish your image. So, Pls help."}, {"id": "1418220776172318721", "text": "I am really impressed with the @urbancompany_UC professional Pramod. They offered a safe and hygienic Hair Services for Women service. Recommending Pramod for the UC Safe Badge! #BringHomeTheExperts <https://t.co/E5nIwqf8ep"}, {"id": "1425398299180167168", "text": "I booked a Salon service from @urbancompany_UC. Ranganath sanitised every tool before starting! The service was fantastic and very hygienic. I recommend Ranganath to win the UC Safe Badge! #BringHomeTheExperts"}, {"id": "1513467723938156544", "text": "@urbancompany_UC wht kind of professional ur having onboad, ppl using ur brand name fr personsl business gains, ur CST is also useless #badexperience"}]